insult_list = [
    'иди нахуй!',
    'ты просто коммунарский пидор...',
    'ты кремлебот)0',
    'ты Артём, без негатива',
    'ты носатая крыса',
    'сало упало!',
    'ты пиздюкан',
    'ты хуеглазаяпиздомудопрохуевина',
    'ты секс стариков в троженной массе',
    'ты хуеблядскаяпиздомудопрохуевина'
]
help_description = ''' Префикс бота - !!
Список комманд бота (в скобках указан вариант обращения на русском):

add(сложить) x y - складывает 2 числа x и y, если х и у не являются числами - возвращает оба слова;

roll(ролл) x y - выдает рандомное число от y(указывать по желанию) до х;

hui(хуй) @Участник_сервера - оскорбляет участника сервера по обращению;

joke(шутка) - выдает шутейку)
'''
ukraine = (
    'Слава Украине!',
    'слава украине',
    'Слава Україні!',
    'Слава Україні',
    'слава україні',
    'Слава Украине',
    'слава Украине'
)
bad_words = ['блять', 'блядь', 'хуй', 'пизда', 'пиздец', 'спиздил','ебать', 'уебище', 'уёбище','ебал','ебала']

compliments = [
    ' я, конечно, не водоворот,но тебя засосал бы.',
    ' ты, конечно, не защитная маска,но я бы хотел, чтобы ты оказалась на моем лице.',
    ' твои глаза как выходные. Их тоже два.',
    ' ты как беляш с вокзала: красивый, сочный, опасный. Но внутри псина псиной.',
    ' перестань меня обжигать своей горячностью, у меня закончился солнцезащитный крем.',
    ' ты настоящий ангел, но почему же манишь собой как дьявол?',
    ' ты конечно не разметка, но я бы вставил в тебя 2 пальца.',
    ' ты как казнь в Средневековье – от тебя многие теряют голову.',
    ' мы не носки, но были бы отличной парой.',
    ' тебя, случайно, зовут не Игорь? Меня тоже нет, у нас так много общего!',
    ' ты как сотка, которую теряешь в старой куртке – когда я нашёл тебя, стал счастлив.',
    ' почему все говорят, что лучшее место на Земле – это курорты, ведь мне лучше всех между твоих ног.',
    ' только сейчас, увидев твою фотографию, я понял, что значит «dead inside».'
]

jokes = [
    '''- В чем плюс слепой проститутки?
- Сосет не смотря ни на что! ''',
    '''- Как называют кота, который увлекся бодибилдингом?
- Котлет ''',
    '''- Что общего между почтальоном и яйцами?
- Оба только стучат, но никогда не входят. ''',
    '''- Почему у Максима Галкина дома вечеринка?
- Потому что бабушка уехала ''',
    '''- Как называют одинокого цыгана?
- Айнаненанист.''',
    '''- Кто родится у Никиты Джигурды, если его трахнет Илон Маск?
- Волосатый мотороллер''',
    '''- Почему у инвалидов нет девушки?
 - Потому что они подкатывают ко всем''',
    '''- Что общего у охотника и сутенера?
- Они оба зарабатывают на шкурах!''',
    '''- Почему парни-инвалиды боятся гопников?
- Потому что они не смогут постоять за свою девушку!''',
    '''- Как остановить драку слепых?
- Крикнуть я ставлю на того с ножом!''',
    '''- Что сделал сирота, когда ему подарили компьютер?
- Создал папку!''',
    '''- Как понять что девушка любит "золотой дождь"?
- У нее на лице НАПИСАНО''',
    '''- Что будет если скрестить ежа и ужа?
- Полтора метра колючей проволоки''',
    '''- Женская профессия, первая буква "Б", последняя "Ь"?
- Библиотекарь...''',
    '''- Что такое свиная отбивная?
- Картошка, отбитая у свиньи''',
    '''- Что нужно сделать, когда голубь нагадит на голову?
- Поблагодарить бога, что коровы не летают''',
    '''- Чем отличаются слепые от картошки?
- У Картошки есть глазки''',
    '''- Почему толстых женщин не берут в стриптиз?
- Они перегибают палку.''',
    '''- Зачем скачивать порно-ролик с карликом?
- Он занимает меньше места.''',
    '''- Почему шутить можно над всеми, кроме безногих?
- Шутки про них обычно не заходят.''',
    '''- Чего общего у некрофила и владельца строительной кампании?
- Они оба имеют недвижимость.''',
    '''- Как называется притон наркоманов-закладчиков?
- Клуб весёлых и находчивых.''',
    '''- Как напугать негра?
- Взять его с собой на аукцион.''',
    '''Каждому корейскому слепому, примерно раз в неделю, требуется новая собака-поводырь''',
    '''Колобок повесился''',
    '''Русалка села на шпагат''',
    '''Медведь сел в машину и сгорел''',
    '''Главная шутка - твое рождение''',
    '''- Что общего между подгорелым пирогом и беременной женщиной?
- Не успели вытащить''',
    '''Буратино утонул''',
    '''- Что говорит еврей-педофил после того, как изнасилования ребенка?
- Отдай конфету''',
    '''- Что общего между гамбургером и ребенком?
- Я не тразаю гамбургер, перед тем, как съесть''',
    '''- Знаешь, почему негры не едят сникерсы?
- Потому что палец боятся откусить''',
    '''- Как называют афроамериканца, который считает, что раньше было лучше?
- Black Бумер''',
    '''- Каких женщин боялись в средние века?
- Чумовых''',
    '''- Мам, я не хочу к бабушке!
- Заткнись и копай''',
    '''- Как на английском зовут безногого Олега?
- 0-leg''',
    '''Водитель автобуса съел сникерс и не тормозил две остановки'''
]